{
    "bosses": [
        {
            "name": "tuckersKobolds",
            "namePretty": "Tucker's Kobolds",
            "weakness": "automaticCrossbow",
            "description": "Several kobolds fighting together. Trained in guerilla warfare tactics.",
            "fightDamage": "The kobolds skillfully use various places in the room for cover. One throws a molotov cocktail toward you, another shoots an arrow, and a third hurls a medium sized rock. You lose one point of damage.",
            "fightDie": "The kobolds' war of attrition has failed. Their squadron is entirely dead. In the distance you hear a helicopter fleeing. The Jimi Hendrix cover of \"All Along the Watchtower\" plays in your mind."
        },
        {
            "name": "death",
            "namePretty": "Death",
            "weakness": "bananaPeel",
            "description": "Cloaked in a black robe and weilding a silver scythe, this otherwise ordinary floating skeleton chills you with an otherwordly presence.",
            "fightDamage": "Death floats over toward you, touching down with a single skeletal foot. It reaches out to touch you with it's hand. You lose one point of damage.",
            "fightDie": "Death floats over toward you, touching down with a single skeletal foot... right onto the discarded banana peel. It slips all the way out of the room, where loud crashing and falling can be heard trailing off in the distance."
        },
        {
            "name": "Kerfluffle",
            "namePretty": "Kerfluffle",
            "weakness": "handheldVacuumCleaner",
            "description": "What seems to be a giant agglomeration of dust bunnies, out for revenge.",
            "fightDamage": "The Kerfluffle bounds foward and engulfs you in soft, choking dust.  You try to inhale and are overwhelmed with coughing.  You lose one point of health.",
            "fightDie": "The Kerfluffle is drawn inexorably into the handheld vacuum cleaner and disappears.  The noise of the vacuum drowns out any last cries of Kerfluffle's constituent dust bunnies."
        }
    ]
}