{
    "monsters": [
        {
            "id": 1,
            "name": "werebeaver",
            "namePretty": "Werebeaver",
            "description": "Some poor humanoid has become infected with werebeaveritis. They have turned into a rabid beaver. It thinks you kicked its dam and it's not happy about it.",
            "weakness": "silver",
            "fightDamage": "The werebeaver skillfully dodges your attack, using its tail as a springboard to get close enough to sink its vile teeth into your leg. You lose one point of health.",
            "fightDie": "The werebeaver goes limp and falls to the ground.",
            "dead": false,
            "corpse": "The lumpy body of the werebeaver lies huddled on the floor, powerful tail now limp and unmoving.",
            "monster": true
        },{
            "id": 2,
            "name": "monstrousKoiFish",
            "namePretty": "Monstrous Koi Fish",
            "description": "An evil mage has gigantified a once-pretty-looking koi fish and granted it the ability to breathe air. It now sports fangs and a denim jacket with the sleeves ripped off. It has sick tribal tats around its fins.",
            "weakness": "cattleProd",
            "fightDamage": "The monstrous koi fish wobbles around your attack. It then slides toward you, sinking its fang into you. You lose one point of health.",
            "fightDie": "The koi fish suddenly stiffens its muscles. It begins to shrink, slowly at first, then rapidly. It is now the size of a typical koi, flopping around inside the denim jacket it once wore.",
            "dead": false,
            "corpse": "The disintegrating body of a small, colorful koi fish lies in a small puddle on the ground.",
            "monster": true
        },{
            "id": 3,
            "name": "pheonixBear",
            "namePretty": "Phoenix Bear",
            "description": "It appears to be part bear, part phoenix with a large blue mane and azure fur.",
            "weakness": "toxic" ,
            "fightDamage": "The Pheonix Bear RAGES, dropping its head and charging at you with its fearsome claws. You lose one point of health.",
            "fightDie": "The Phoenix Bear gives a whimpering cry, self-engulfing into a pile of ash... better get out of here fast.",
            "dead": false,
            "corpse": "There is a pile of ash where the Pheonix Bear used to be.",
            "monster": true
        },{
            "id": 4,
            "name": "mummy",
            "namePretty": "Mummy",
            "description": "Wrapped in ancient cloths, this creature moans in a low rummbling tone",
            "weakness": "fire",
            "fightDamage": "The mummy is faster than it looks, and before you know it, the creature has grabbed you. You feel lifeforce drain out of your body. You lose one point of health.",
            "fightDie": "The mummy, in one final gasp, crumbles into a pile of cloth.",
            "dead": false,
            "corpse": "There is a pile of crumbling cloth bandages where the mummy used to be.",
            "monster": true
        },{
            "id": 5,
            "name": "frumiousBandersnatch",
            "namePretty": "Frumious Bandersnatch",
            "description": "Loping and lolloping along toward you, jaws agape and tongue lolling out between fangs of preposterous proportion, the Bandersnatch of sagas is at all times famishing and eager for the hunt.",
            "weakness": "sword",
            "fightDamage": "The Bandersnatch lunges toward you and sinks its fangs to the bone in your leg. You lose one point of health.",
            "fightDie": "The Bandersnatch staggers, roaring, before collapsing in an untidy heap of long limbs and grinning fangs.",
            "dead": false,
            "corpse": "The Bandersnatch sprawls on the ground, thoroughly dead.",
            "monster": true
        },{
            "id": 6,
            "name": "greenOoze",
            "namePretty": "Green Ooze",
            "description": "The bright, rippling green of a bowl of jello, but grown to shocking size, endowed with two red eyes, and squelching toward you.",
            "weakness": "wand",
            "fightDamage": "The Ooze extends a psuedopod which glops onto your leg.  Acid burns you.  You lose one point of health.",
            "fightDie": "The Ooze explodes into a shower of jello, leaving sticky puddles all over the floor.",
            "dead": false,
            "corpse": "The walls are splotched with smears of sticky green.  A good mopping would definitely help.",
            "monster": true
        },{
            "id": 7,
            "name": "mimic",
            "namePretty": "Mimic",
            "description": "An innocuous treasure chest that seems completely non-threatening",
            "weakness": "cattleProd",
            "fightDamage": "The treasure chest jumps out at you, biting into your arm.  You lose one point of health.",
            "fightDie": "The treasure chest falls over with a pathetic gurgle.",
            "dead": false,
            "corpse": "The empty mimic is spread-eagled on the ground, quite dead.",
            "monster": true
        },{
            "id": 8,
            "name": "flameElemental",
            "namePretty": "Flame Elemental",
            "description": "You see what appears to be a sentient flame enjoying its day in this fine dungeon",
            "weakness": "bocketOWater",
            "fightDamage": "The flames jump at you and burn brightly scorching you.",
            "fightDie": "Proper fire safety training has ut the flames out.",
            "dead": false,
            "corpse": "A scorched spot is on the ground.",
            "monster": true
        },{
            "id": 9,
            "name": "faerie",
            "namePretty": "Faerie",
            "description": "A glowing purple ball appears to be in the room, it appears slightly malevolent",
            "weakness": "sword",
            "fightDamage": "The faerie strikes back at you before crumbling into dust. You lose one point of health.",
            "fightDie": "The light fades as the fae falls to the ground crumbling to dust.",
            "dead": false,
            "corpse": "You see a pile of dust while inactive it still radiates malevolence.",
            "monster": true
        },{
            "id": 10,
            "name": "treasure_find",
            "namePretty": "",
            "description": "You don't see any monsters, but there is a small pile of rubble that might be hiding something.",
            "weakness": "",
            "fightDamage": "",
            "fightDie": "",
            "dead": false,
            "corpse": "You don't see any monsters, but the floor is littered with rubble."
        },
        {
            "id": 11,
            "name": "treasure_find",
            "namePretty": "",
            "description": "You don't see any monsters, but there is a small chest, the wood so soft and rotten you can push through it easily.",
            "weakness": "",
            "fightDamage": "",
            "fightDie": "",
            "dead": false,
            "corpse": "You don't see any monsters, but there is a small chest, the wood of its top has been broken through to expose its empty contents"
        },{
            "id": 12,
            "name": "treasure_find",
            "namePretty": "",
            "description": "You don't see any monsters, but one section of the wall looks suspiciously discolored and cracked.",
            "weakness": "",
            "fightDamage": "",
            "fightDie": "",
            "dead": false,
            "corpse": "You don't see any monsters, but one section of the wall has been broken away leaving an empty nook."
        },{
            "id": 13,
            "name": "treasure_find",
            "namePretty": "",
            "description": "You don't see any monsters, but there is an ancient wooden chest with a rust-eaten lock.",
            "weakness": "",
            "fightDamage": "",
            "fightDie": "",
            "dead": false,
            "corpse": "You don't see any monsters, but there is an open and empty ancient wooden chest."
        },{
            "id": 14,
            "name": "treasure_find",
            "namePretty": "",
            "description": "You don't see any monsters, but there is a skeleton dressed in rags, still cradling something in its bony grip.",
            "weakness": "",
            "fightDamage": "",
            "fightDie": "",
            "dead": false,
            "corpse": "You don't see any monsters, but there is a skeleton dressed in rags."
        },{
            "id": 15,
            "name": "treant",
            "namePretty": "Treant",
            "description": "If trees could walk around and look pissed that would be an acurate description of what you see",
            "weakness": "fire",
            "fightDamage": "The treant strickes at you before falling to pieces. You lose one point of health.",
            "fightDie": "The flames burn the treant to cinders.",
            "dead": false,
            "corpse": "You see the remains of a once great tree",
            "monster": true
        },{
            "id": 16,
            "name": "honeyBadger",
            "namePretty": "Honey Badger",
            "description": "Honey Badger DGAF",
            "weakness": "none",
            "fightDamage": "You were bitten by the Honey Badger, you might want to check for rabies when you get out. You lose one point of health.",
            "fightDie": "",
            "dead": false,
            "corpse": "Honey Badger is just sitting there.",
            "monster": true
        },{
            "id": 17,
            "name": "waitInLine",
            "namePretty": "Queue",
            "trap": true,
            "description": "You find yourself in at the back of queue with people waiting in line ahead of you. ",
            "weakness": "none",
            "fightDamage": "You attacked the people in the queue. They did not appreciate that. You lose one point of health.",
            "fightDie": "Thank you for your patience.",
            "dead": false,
            "corpse": "You see the queue you fondly remember waiting in",
            "monster": false
        },{
            "id": 18,
            "name": "zombie",
            "namePretty": "Zombie",
            "description": "That corpse appears to be moving. Maybe you should do something about that?",
            "weakness": "fire",
            "fightDamage": "You attack the zombie with all your might and managed to take it down, but at what cost? You lose one point of health.",
            "fightDie": "The zombie burns to to cinders. The apocalypse is staved off once again.",
            "dead": false,
            "corpse": "The remains of what was once a person, reanimated and defiled, now lie still.",
            "monster": true
        },{
            "id": 19,
            "name": "bear",
            "namePretty": "Sir Bearington",
            "description": "A rather large, hairy man wearing a fine tailored suit and a monocle stands in the room.  His accent is quite thick and you cannot easily discern what what he is saying.",
            "weakness": "wand",
            "fightDamage": "You attack the man strikes back at you with his large ... PAWS?  You lose one point of health.",
            "fightDie": "Your magical blast blows away the suit and reveals Sir Bearington for what he actually is, a bear. He falls over upon his defeat.",
            "dead": false,
            "corpse": "The remains of a once mighty bear lie still upon the dungeon floor.",
            "monster": true
        },{
            "id": 20,
            "name": "banshee",
            "namePretty": "Banshee",
            "description": "A hooded figure hovers within the room. They appear to be making no moves but an ominous mist emanates from them.",
            "weakness": "sword",
            "fightDamage": "The figure lets out a blood curdling scream as they fall to the ground. It is so powerful it damages even your mighty figure. You lose one point of health.",
            "fightDie": "The figure fades as your weapon moves through their form, leaving a grey puddle of shadows.",
            "dead": false,
            "corpse": "What appears to be a puddle of shadows lies where the spirit fell.",
            "monster": true
        },{
            "id": 21,
            "name": "stoneGolem",
            "namePretty": "Stone Golem",
            "description": "A small, gnome shaped, stone stands in disinterested in the room ocasionally moving through the room.",
            "weakness": "bananaPeel",
            "fightDamage": "The golem strikes out towards you before falling to the ground crumbling. You lose one point of health.",
            "fightDie": "The golem slips on the banana peal falling and shattering.",
            "dead": false,
            "corpse": "A pile of stone body parts lies with an almost annoyed look about it.",
            "monster": true
        }
    ]
}