{
    "monsters": [
        {
            "name": "werebeaver",
            "namePretty": "Werebeaver",
            "description": "Some poor humanoid has become infected with werebeaveritis. They have turned into a rabid beaver. It thinks you kicked its dam and it's not happy about it.",
            "weakness": "fire",
            "fightDamage": "The werebeaver skillfully dodges your attack, using its tail as a springboard to get close enough to sink its vile teeth into your leg. You lose one point of health.",
            "fightDie": "The werebeaver goes limp and falls to the ground."
        },
        {
            "name": "monstrousKoiFish",
            "namePretty": "Monstrous Koi Fish",
            "description": "An evil mage has gigantified a once-pretty-looking koi fish and granted it the ability to breathe air. It now sports fangs and a denim jacket with the sleeves ripped off. It has sick tribal tats around its fins.",
            "weakness": "electricity",
            "fightDamage": "The monstrous koi fish wobbles around your attack. It then slides toward you, sinking its fang into you. You lose one point of health.",
            "fightDie": "The koi fish suddenly stiffens its muscles. It begins to shrink, slowly at first, then rapidly. It is now the size of a typical koi, flopping around inside the denim jacket it once wore."
        },
        {
            "name": "frumiousBandersnatch",
            "namePretty": "Frumious Bandersnatch",
            "description": "Loping and lolloping along toward you, jaws agape and tongue lolling out between fangs of preposterous proportion, the Bandersnatch of sagas is at all times famishing and eager for the hunt.",
            "weakness": "sword",
            "fightDamage": "The Bandersnatch lunges toward you and sinks its fangs to the bone in your leg. You lose one point of health.",
            "fightDie": "The Bandersnatch staggers, roaring, before collapsing in an untidy heap of long limbs and grinning fangs."
          },
          {
            "name": "greenOoze",
            "namePretty": "Green Ooze",
            "description": "The bright, rippling green of a bowl of jello, but grown to shocking size, endowed with two red eyes, and squelching toward you.",
            "weakness": "magic",
            "fightDamage": "The Ooze extends a psuedopod which glops onto your leg.  Acid burns you.  You lose one point of health.",
            "fightDie": "The Ooze explodes into a shower of jello, leaving sticky puddles all over the floor."
          }
    ]
}
