{
    "rooms": [
        {
            "id": 1,
            "name": "storageRoom",
            "namePretty": "Storage Room",
            "description": "This is what appears to be an old storage closet. You see dusty shelves with spider webs. A few objects line the shelves, such as cups and a broom. There is a stench of stale air mixed with pine. Perhaps someone once kept the dungeon clean."
        },
        {
            "id": 2,
            "name": "campRoom",
            "namePretty": "Camp Room",
            "description": "This room appears to be where someone has made camp. There are ashes where a fire was made, but has been long extinguished. A bedroll lies nearby. The rest of the room is sparse."
        },
        {
            "id": 3,
            "name": "lakeRoom",
            "namePretty": "Lake Room",
            "description": "A dark pool with an ornately carved stone lip fills the center of this room.  The water is very still.  You can't tell how deep it is."
        },
        {
            "id": 4,
            "name": "stalactiteRoom",
            "namePretty": "Stalactite Room",
            "description": "Stalactites in many colors festoon the ceiling in this room.  The floor is bumpy with their partner stalagmites.  You'll have to pick your way through carefully."
        },
        {
            "id": 5,
            "name": "obitalControlRoom",
            "namePretty": "Orbital Ion Canon Control Room",
            "description": "This room appears to have many computers running at once with a large screen detailing various other places in the world. How did you get here?"
        },
        {
            "id": 6,
            "name": "dungeonRoom",
            "namePretty": "Dungeon",
            "description": "The smell hits you before you have time to take in your surroundings. It's dark, with chains and cages lining the walls, lit with lightly flickering torches."
        },
        {
            "id": 7,
            "name": "dragonCave",
            "namePretty": "Dragon's Home",
            "description": "As you enter the room, you see a two dragons lying around a raised stone platform. The edges of the room are darkened and they do not appear to be paying attention to you."
        },
        {
            "id": 8,
            "name": "labyrinth",
            "namePretty": "Labyrinth",
            "description": "A massive, ornate twisting maze sprawls before you. It's really easy."
        },
        {
            "id": 9,
            "name": "elevator",
            "namePretty": "Ascending Room",
            "description": "A tight-fitting room with buttons for NORTH, EAST, SOUTH, WEST on a square, brass panel."
        },
        {
            "id": 10,
            "name": "throneRoom",
            "namePretty": "Throne Room",
            "description": "A lavish vaulted hall leads up a set of stone stairs to a large throne. Torches light the walls and tapastry that hang from the ceiling."
        },
        {
            "id": 11,
            "name": "deskRoom",
            "namePretty": "Classroom",
            "description": "Ancient wood hewn desks litter an open room. Countless faded equations besmear a framed chalkboard on the far wall."
        },
        {
            "id": 12,
            "name": "stable",
            "namePretty": "Stable",
            "description": "A wooden stable with some hay and horses. If you ask to ride one they say neigh"
        },
        {
            "id": 13,
            "name": "royalBathHouse",
            "namePretty": "Royal Bath House",
            "description": "Is that a waterfall over there? Sometimes it's good to be the king"
        },
        {
            "id": 14,
            "name": "aquarium",
            "namePretty": "Aquarium",
            "description": "The walls of this room are lined with glass behind which you see large aquatic creatures just sort of hanging out."
        },
        {
            "id": 15,
            "name": "forestRoom",
            "namePretty": "Forest",
            "description": "The room opens up to show a thick forest brush intermixed with trees. It is quiet, too quiet."
        },
        {
            "id": 16,
            "name": "temple",
            "namePretty": "Temple",
            "description": "You find yourself in what appears to be a long abandoned room of worship, the altar at the center appears to bear the insignia of a long forgotton deity."
        },
        {
            "id": 17,
            "name": "werewolfCircle",
            "namePretty": "Game Room",
            "description": "You find what appears to be a hotel conference room. Within it are peopel rythmically tapping on there legs with one person standing around the directing them. There are mutterings about a werewolf."
        },
        {
            "id": 18,
            "name": "dnD",
            "namePretty": "Basement",
            "description": "You see five people sitting around a table, wearing robes, starting at paper, and screaming at plastic polyhedrons."
        }
    ]
}